



What is a database-- data base is a collection of data and holds the data in the form of tables.
---------------------------------------------------------------------------------------
---------------------------------------------------------------------------------------


What is a table --- holds the data in form of rows and columns.
---------------------------------------------------------------
---------------------------------------------------------------


It is similar to excel spreadsheet.
-----------------------------------
-----------------------------------
When a excel spreadsheet holds the data in the same way why do we require this database?

Problem with excel spreadsheet is it what if let's say 1000s of spreadsheets which hold more than 100000s of data
it become very tidious and cumbersome and totally unmanageable to give insights to this huge data. This is why the better
 way is to have a database and it will provide you n number of other functionalities also.

-------------

The database provides us the capability to access and manipulate this data.
---------------------------------------------------------------------------
---------------------------------------------------------------------------


Because storing the data is not the only thing we should be able to interact with this data 
we should be able to retrieve the data we should be able to update or modify the data 
whatever we want we should be able to do and these are the one of the capabalities which our database will provide us.





2 types of databases
----------------------
----------------------

1. Relational Database - A relational database is the one in which we store the data 
in the form of   rows & columns and also the tables have relation between them.
For ex we might have an employee table in which employee id is there and departments table with department id and each employee can have a department id 
which relate them to that employee table which means two tables will have some relation on them.
that's why we called it a relational database.

MySQL,
SQL Server,
PostgreSQL,

SQLite,
MariaDB.

2. NOSQL Database -- is the one where we have a Key value, Document, Graph  
here the data is not stored in the form of rows and columns and also two tables do not have any relation in them

Hbase,
Mongodb,
Cassandra,
------------------------

--------



why My sql

it is something which is used in lot of places. it is in very high demand that is why we are going to learn this 

what if anyone ask to work on sql server or postgreSQL I would say you would not have to really worry the sql staements 
learned with this class should work on other databases like sql server,  with minor changes.

------------------------------------------------------------------------
----------------------------------------------------------------------------


SQL ---> SQL stands for structure query language -
Because this language is used to work with structured data that is data in the form of rows and columns.

SQL is a language through which we are interacting with the databases.
So basically sql is a language through which you will be interacting with the databases.


For ex --- we have a mysql data and someone says write a query to insert the data.
or to update the record or to delete the record from their MySQL database  

So MySQL is a database and SQL is a way to interact with this database. You can say to communicate with the database.


--------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------
SQL - s used to query a relational database.

#### SQL And SQLite

SQL (Structured Query Language) is a standard language for managing and manipulating relational databases. SQLite is a self-contained, serverless, and zero-configuration database engine that is widely used for embedded database systems. In this lesson, we will cover the basics of SQL and SQLite, including creating databases, tables, and performing various SQL operations.

In [1]:
import sqlite3

In [2]:
# connect to a sqllite database
connection_1 = sqlite3.connect("tables_1.db")
connection_1

In [3]:
cursor_1 = connection_1.cursor()

In [4]:
cursor_1.execute('''
    Create Table If Not Exists students(
    enrollement_id Integer Primary Key,
    student_name Text Not Null,
    student_age Integer,
    student_group text)
''')
## Commit the changes
connection_1.commit()

In [5]:
cursor_1.execute('''
Select * from students
    
''')

In [6]:
cursor_1.execute("""
Insert into students(enrollement_id,student_name,student_age,student_group)
                 values(1,'Rishi',19,"Dayanand")
""")

cursor_1.execute("""
Insert into students(enrollement_id,student_name,student_age,student_group)
                 values(2,'Sagar',21,"Aurbindo")
""")

cursor_1.execute("""
Insert into students(enrollement_id,student_name,student_age,student_group)
                 values(3,'Sapna',24,"Vivekanand")
""")

cursor_1.execute('''
Insert into students(enrollement_id,student_name,student_age,student_group)
                 values(4,'Yashi',19,"Dayanand")
''')


# commiting the changes
connection_1.commit()

In [9]:
cursor_1.execute('''
Insert into students(enrollement_id,student_name,student_age,student_group)
                 values(5,'Ankul',25,"Shradhanand")
''')
# commiting the changes
connection_1.commit()

In [10]:
cursor_1.execute('''
Select * from students
    
''')

rows = cursor_1.fetchall()

for x in rows:
    print(x)

(1, 'Rishi', 19, 'Dayanand')
(2, 'Sagar', 21, 'Aurbindo')
(3, 'Sapna', 24, 'Vivekanand')
(4, 'Yashi', 19, 'Dayanand')
(5, 'Ankul', 25, 'Shradhanand')

In [11]:
## Connect to an SQLite database
connection=sqlite3.connect('example.db')
connection

In [12]:
cursor=connection.cursor()

In [13]:
## Create a Table
cursor.execute('''
Create Table If Not Exists employees(
    id Integer Primary Key,
    name Text Not Null,
    age Integer,
    department text
    )
''')

## Commit the changes
connection.commit()

In [14]:
## Insert the data in sqlite table
cursor.execute('''
Insert Into employees(name,age,department)
               values('Abhishek',31,'AI Engineer')

''')

cursor.execute('''
INSERT INTO employees (name, age, department)
VALUES ('Bob', 25, 'Engineering')
''')

cursor.execute('''
INSERT INTO employees (name, age, department)
VALUES ('Charlie', 35, 'Finance')
''')

## commi the changes
connection.commit()

In [15]:
## Query the data from the table
cursor.execute('Select * from employees')
rows=cursor.fetchall()

## print the queried data

for row in rows:
    print(row)

(1, 'Abhishek', 31, 'AI Engineer')
(2, 'Bob', 25, 'Engineering')
(3, 'Charlie', 35, 'Finance')

In [16]:
## Update the data in the table
cursor.execute('''
UPDATE employees
Set age=34
where name="Abhishek"
''')

connection.commit()

In [17]:
## Update the data in the table
cursor.execute('''
UPDATE employees
Set department='CTO'
where name="Abhishek"
''')

connection.commit()

In [18]:
## Query the data from the table
cursor.execute('Select * from employees')
rows=cursor.fetchall()

## print the queried data

for row in rows:
    print(row)

(1, 'Abhishek', 34, 'CTO')
(2, 'Bob', 25, 'Engineering')
(3, 'Charlie', 35, 'Finance')

In [19]:
## Delete the data from the table
cursor.execute('''
Delete from employees
               where name ='Bob'
''')

connection.commit()

In [20]:
## Query the data from the table
cursor.execute('Select * from employees')
rows=cursor.fetchall()

## print the queried data

for row in rows:
    print(row)

(1, 'Abhishek', 34, 'CTO')
(3, 'Charlie', 35, 'Finance')

In [21]:
## Working with Sales Data
# Connect to an SQLite database
connection = sqlite3.connect('sales_data.db')
cursor = connection.cursor()

# Create a table for sales data
cursor.execute('''
CREATE TABLE IF NOT EXISTS sales (
    id INTEGER PRIMARY KEY,
    date TEXT NOT NULL,
    product TEXT NOT NULL,
    sales INTEGER,
    region TEXT
)
''')

# Insert data into the sales table
sales_data = [
    ('2023-01-01', 'Product1', 100, 'North'),
    ('2023-01-02', 'Product2', 200, 'South'),
    ('2023-01-03', 'Product1', 150, 'East'),
    ('2023-01-04', 'Product3', 250, 'West'),
    ('2023-01-05', 'Product2', 300, 'North')
]

cursor.executemany('''
Insert into sales(date,product,sales,region)
                   values(?,?,?,?)
''',sales_data)

connection.commit()

In [22]:
# Query data from the sales table
cursor.execute('SELECT * FROM sales')
rows = cursor.fetchall()

# Print the queried data
for row in rows:
    print(row)

(1, '2023-01-01', 'Product1', 100, 'North')
(2, '2023-01-02', 'Product2', 200, 'South')
(3, '2023-01-03', 'Product1', 150, 'East')
(4, '2023-01-04', 'Product3', 250, 'West')
(5, '2023-01-05', 'Product2', 300, 'North')

In [23]:
## close the connection
connection.close()

In [24]:
connection_1.close()

In [25]:
# Query data from the sales table
cursor.execute('SELECT * FROM sales')
rows = cursor.fetchall()

# Print the queried data
for row in rows:
    print(row)

ProgrammingError: Cannot operate on a closed database.

In [26]:
# Query data from the students table
cursor.execute('SELECT * FROM students')
rows = cursor.fetchall()

# Print the queried data
for row in rows:
    print(row)

ProgrammingError: Cannot operate on a closed database.

In [27]:
connection = sqlite3.connect('sales_data.db')
cursor = connection.cursor()

In [29]:
cursor.execute('SELECT * FROM sales')
rows = cursor.fetchall()

# Print the queried data
for row in rows:
    print(row)

(1, '2023-01-01', 'Product1', 100, 'North')
(2, '2023-01-02', 'Product2', 200, 'South')
(3, '2023-01-03', 'Product1', 150, 'East')
(4, '2023-01-04', 'Product3', 250, 'West')
(5, '2023-01-05', 'Product2', 300, 'North')

In [30]:
connection.close()